package com.vinda.vpractice2020.widget

import android.os.Bundle
import android.view.Menu
import androidx.appcompat.app.AppCompatActivity
import com.vinda.vpractice2020.R

class WidgetTestActivity : AppCompatActivity() {
    private val content =
        "他缓缓的回过头看向她，压抑在心底的思恋与难过再也无法隐藏。“那天你走之后，我一个人去了桃源，我们中的漫山桃花都已盛开，当清风吹过时，我听到了树枝颤动的声音接着闻到了阵阵桃花香，那天晚上的月亮也格外的明亮；一切都那么美好，可我的心却有种说不出的难受，我不明白，为什么会这样。后来我去到桃园的小木屋，躺着床上仔细的思考着为什么然后脑海里突然出现了你的身影，我恍然大悟原来这美景里缺了一个你啊”谢雨霜抬起头望向他那双充满血丝的眼睛再也控制不住自己对他的思恋之情，这一刻，她甚至觉得自己可以不再被那些世俗恩怨所困扰，一辈子就和他在桃园里日出而作日落而息的过平凡人的生活便够了。刀渐渐从手中滑落，谢雨霜上前两步紧紧抱住，这一刻的场景她曾以为这辈子都不会再有，还好，上天并未对她赶尽杀绝。“雪江，我们都放下那些恩怨好不好？我们就我们两个去桃园好好生活，过平凡人的生活好吗？”秦雪江对谢雨霜的话语有些惊讶但片刻他便反应过来，漏出惊喜的表情，原来这场感情里，他并非只是独角戏，她爱他，宁愿为了他放弃她的血海深仇，这就够了。“好我们去过平凡的日子，就我们两个。”在月光下，他们的身影被拉长，第一次谢雨霜觉得自己不再那么累了，她不想回去了，也不想管那位大小姐家的一切了，她只想爱她。作者：万生93链接：https://www.jianshu.com/p/76e19c5d8503来源：简书著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。" +
                "他缓缓的回过头看向她，压抑在心底的思恋与难过再也无法隐藏。“那天你走之后，我一个人去了桃源，我们中的漫山桃花都已盛开，当清风吹过时，我听到了树枝颤动的声音接着闻到了阵阵桃花香，那天晚上的月亮也格外的明亮；一切都那么美好，可我的心却有种说不出的难受，我不明白，为什么会这样。后来我去到桃园的小木屋，躺着床上仔细的思考着为什么然后脑海里突然出现了你的身影，我恍然大悟原来这美景里缺了一个你啊”谢雨霜抬起头望向他那双充满血丝的眼睛再也控制不住自己对他的思恋之情，这一刻，她甚至觉得自己可以不再被那些世俗恩怨所困扰，一辈子就和他在桃园里日出而作日落而息的过平凡人的生活便够了。刀渐渐从手中滑落，谢雨霜上前两步紧紧抱住，这一刻的场景她曾以为这辈子都不会再有，还好，上天并未对她赶尽杀绝。“雪江，我们都放下那些恩怨好不好？我们就我们两个去桃园好好生活，过平凡人的生活好吗？”秦雪江对谢雨霜的话语有些惊讶但片刻他便反应过来，漏出惊喜的表情，原来这场感情里，他并非只是独角戏，她爱他，宁愿为了他放弃她的血海深仇，这就够了。“好我们去过平凡的日子，就我们两个。”在月光下，他们的身影被拉长，第一次谢雨霜觉得自己不再那么累了，她不想回去了，也不想管那位大小姐家的一切了，她只想爱她。作者：万生93链接：https://www.jianshu.com/p/76e19c5d8503来源：简书著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。" +
                "他缓缓的回过头看向她，压抑在心底的思恋与难过再也无法隐藏。“那天你走之后，我一个人去了桃源，我们中的漫山桃花都已盛开，当清风吹过时，我听到了树枝颤动的声音接着闻到了阵阵桃花香，那天晚上的月亮也格外的明亮；一切都那么美好，可我的心却有种说不出的难受，我不明白，为什么会这样。后来我去到桃园的小木屋，躺着床上仔细的思考着为什么然后脑海里突然出现了你的身影，我恍然大悟原来这美景里缺了一个你啊”谢雨霜抬起头望向他那双充满血丝的眼睛再也控制不住自己对他的思恋之情，这一刻，她甚至觉得自己可以不再被那些世俗恩怨所困扰，一辈子就和他在桃园里日出而作日落而息的过平凡人的生活便够了。刀渐渐从手中滑落，谢雨霜上前两步紧紧抱住，这一刻的场景她曾以为这辈子都不会再有，还好，上天并未对她赶尽杀绝。“雪江，我们都放下那些恩怨好不好？我们就我们两个去桃园好好生活，过平凡人的生活好吗？”秦雪江对谢雨霜的话语有些惊讶但片刻他便反应过来，漏出惊喜的表情，原来这场感情里，他并非只是独角戏，她爱他，宁愿为了他放弃她的血海深仇，这就够了。“好我们去过平凡的日子，就我们两个。”在月光下，他们的身影被拉长，第一次谢雨霜觉得自己不再那么累了，她不想回去了，也不想管那位大小姐家的一切了，她只想爱她。作者：万生93链接：https://www.jianshu.com/p/76e19c5d8503来源：简书著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。" +
                "他缓缓的回过头看向她，压抑在心底的思恋与难过再也无法隐藏。“那天你走之后，我一个人去了桃源，我们中的漫山桃花都已盛开，当清风吹过时，我听到了树枝颤动的声音接着闻到了阵阵桃花香，那天晚上的月亮也格外的明亮；一切都那么美好，可我的心却有种说不出的难受，我不明白，为什么会这样。后来我去到桃园的小木屋，躺着床上仔细的思考着为什么然后脑海里突然出现了你的身影，我恍然大悟原来这美景里缺了一个你啊”谢雨霜抬起头望向他那双充满血丝的眼睛再也控制不住自己对他的思恋之情，这一刻，她甚至觉得自己可以不再被那些世俗恩怨所困扰，一辈子就和他在桃园里日出而作日落而息的过平凡人的生活便够了。刀渐渐从手中滑落，谢雨霜上前两步紧紧抱住，这一刻的场景她曾以为这辈子都不会再有，还好，上天并未对她赶尽杀绝。“雪江，我们都放下那些恩怨好不好？我们就我们两个去桃园好好生活，过平凡人的生活好吗？”秦雪江对谢雨霜的话语有些惊讶但片刻他便反应过来，漏出惊喜的表情，原来这场感情里，他并非只是独角戏，她爱他，宁愿为了他放弃她的血海深仇，这就够了。“好我们去过平凡的日子，就我们两个。”在月光下，他们的身影被拉长，第一次谢雨霜觉得自己不再那么累了，她不想回去了，也不想管那位大小姐家的一切了，她只想爱她。作者：万生93链接：https://www.jianshu.com/p/76e19c5d8503来源：简书著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。" +
                "他缓缓的回过头看向她，压抑在心底的思恋与难过再也无法隐藏。“那天你走之后，我一个人去了桃源，我们中的漫山桃花都已盛开，当清风吹过时，我听到了树枝颤动的声音接着闻到了阵阵桃花香，那天晚上的月亮也格外的明亮；一切都那么美好，可我的心却有种说不出的难受，我不明白，为什么会这样。后来我去到桃园的小木屋，躺着床上仔细的思考着为什么然后脑海里突然出现了你的身影，我恍然大悟原来这美景里缺了一个你啊”谢雨霜抬起头望向他那双充满血丝的眼睛再也控制不住自己对他的思恋之情，这一刻，她甚至觉得自己可以不再被那些世俗恩怨所困扰，一辈子就和他在桃园里日出而作日落而息的过平凡人的生活便够了。刀渐渐从手中滑落，谢雨霜上前两步紧紧抱住，这一刻的场景她曾以为这辈子都不会再有，还好，上天并未对她赶尽杀绝。“雪江，我们都放下那些恩怨好不好？我们就我们两个去桃园好好生活，过平凡人的生活好吗？”秦雪江对谢雨霜的话语有些惊讶但片刻他便反应过来，漏出惊喜的表情，原来这场感情里，他并非只是独角戏，她爱他，宁愿为了他放弃她的血海深仇，这就够了。“好我们去过平凡的日子，就我们两个。”在月光下，他们的身影被拉长，第一次谢雨霜觉得自己不再那么累了，她不想回去了，也不想管那位大小姐家的一切了，她只想爱她。作者：万生93链接：https://www.jianshu.com/p/76e19c5d8503来源：简书著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。"

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_widget)
        setSupportActionBar(findViewById(R.id.toolbar))

        var scrollTextView = findViewById<ScrollTextView>(R.id.scrollView)
        var scrollTextViewParams = SmartScrollTextViewParams()
        scrollTextViewParams.content = content
        scrollTextViewParams.textSize = 20
        scrollTextViewParams.scrollDirect =SmartScrollTextViewParams.SCROLL_RIGHT_TO_LEFT
        scrollTextView.initialization(scrollTextViewParams)
        scrollTextView.startScroll()
    }

    override fun onCreateOptionsMenu(menu: Menu): Boolean {
        // Inflate the menu; this adds items to the action bar if it is present.

        return true
    }


}